liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/blademotor.c
/****************************************************************************
* Title                 :   
* Filename              :   blademotor.c
* Author                :   Nekraus
* Origin Date           :   17/08/2022
* Version               :   1.0.0

*****************************************************************************/
/** \file blademotor.c
*  \brief 
*
*/
/******************************************************************************
* Includes
*******************************************************************************/
#include <string.h>
#include <stdbool.h>

#include "stm32f_board_hal.h"

#include "main.h"
#include "board.h"
#include "emergency.h"

#include "blademotor.h" 

/******************************************************************************
* Module Preprocessor Constants
*******************************************************************************/
#define BLADEMOTOR_LENGTH_INIT_MSG 22
#define BLADEMOTOR_LENGTH_RQST_MSG 7
#define BLADEMOTOR_LENGTH_VERSION_MSG 7
/* Reversal requires an accepted OFF transmission and qualifying ESC reports.
 * The tested 500 holds its speed word after OFF, then clears it; it reports no
 * progressive coast-down curve. These guards are not a mechanical stop model. */
#define BLADEMOTOR_REVERSE_OFF_MS 1000u
#define BLADEMOTOR_ZERO_CONFIRM_MS 300u
#define BLADEMOTOR_FEEDBACK_MAX_AGE_MS 300u
#define BLADEMOTOR_REVERSE_REPORT_MS 5000u
#define BLADEMOTOR_RX_TIMEOUT_MS 100u
#ifndef BLADEMOTOR_COASTDOWN_VALIDATION
#define BLADEMOTOR_COASTDOWN_VALIDATION 0
#endif
#if BLADEMOTOR_COASTDOWN_VALIDATION && !BOARD_YARDFORCE500_VARIANT_ORIG
#error "Coast-down validation uses the Yardforce500 UART debug output"
#endif
/******************************************************************************
* Module Preprocessor Macros
*******************************************************************************/

/******************************************************************************
* Module Typedefs
*******************************************************************************/
typedef enum {
#if defined(BLADEMOTOR_SEQUENCED_POWER)
    BLADEMOTOR_RESET_HOLD,
    BLADEMOTOR_LOGIC_BOOT,
    BLADEMOTOR_VERSION_WAIT,
    BLADEMOTOR_MATRIX_WAIT,
    BLADEMOTOR_POWER_WAIT,
#endif
    BLADEMOTOR_INIT_1,
    BLADEMOTOR_INIT_2,
    BLADEMOTOR_RUN
}BLADEMOTOR_STATE_e;

/******************************************************************************
* Module Variable Definitions
*******************************************************************************/
UART_HandleTypeDef BLADEMOTOR_USART_Handler; // UART  Handle

DMA_HandleTypeDef hdma_uart_blade_rx;
DMA_HandleTypeDef hdma_uart_blade_tx;

static BLADEMOTOR_STATE_e blademotor_eState = BLADEMOTOR_INIT_1;

bool BLADEMOTOR_bActivated = false;
uint16_t BLADEMOTOR_u16RPM = 0;
uint16_t BLADEMOTOR_u16Power = 0;
uint32_t BLADEMOTOR_u32Error = 0;

static uint8_t blademotor_pu8ReceivedData[BLADEMOTOR_LENGTH_RECEIVED_MSG] = {0};
static uint8_t blademotor_pu8RqstMessage[BLADEMOTOR_LENGTH_RQST_MSG]  = {0x55, 0xaa, 0x03, 0x20, 0x80, 0x00, 0xA2};
static uint8_t blademotor_u8OnOff = 0;
static uint8_t blademotor_u8Direction = 0;
static uint8_t blademotor_u8RunDirection = 0;
#if defined(BLADEMOTOR_SEQUENCED_POWER)
static uint32_t blademotor_state_started_tick = 0u;
static bool blademotor_startup_retry_pending = false;
#endif
static volatile bool blademotor_rx_armed = false;
static volatile uint32_t blademotor_rx_started_tick = 0u;
static volatile uint32_t blademotor_last_valid_tick = 0u;
static volatile uint32_t blademotor_fault_sequence = 0u;
static volatile uint8_t blademotor_seen_valid = 0u;
static volatile uint8_t blademotor_last_error = 0u;
static bool blademotor_reverse_pending = false;
static bool blademotor_off_sent = false;
static bool blademotor_zero_seen = false;
static uint32_t blademotor_stop_since, blademotor_zero_since;
static uint32_t blademotor_last_feedback_seq;
static uint32_t blademotor_zero_epoch;
static uint32_t blademotor_pending_since, blademotor_pending_report_tick;
#if BLADEMOTOR_COASTDOWN_VALIDATION
static uint32_t blademotor_trace_seq, blademotor_trace_tx_tick;
static uint8_t blademotor_trace_command;
#endif

typedef struct {
    uint32_t seq, tick, zero_epoch;
    uint16_t reported_speed;
    uint8_t valid, activated, error;
} blademotor_feedback_t;
/* Updated only after RX completion; snapshot with IRQs masked in the foreground.
 * seq/tick identify UART replies, not new physical speed measurements inside the
 * ESC. Never infer deceleration from a held word or use public cached RPM alone.
 * Invalid replies break qualification. Hardware evidence is in BLADE-REVERSE.md. */
static volatile blademotor_feedback_t blademotor_feedback;

const uint8_t blademotor_pcu8Preamble[5]  = {0x55,0xAA,0x0A,0x2,0xD0};
const uint8_t blademotor_pcu8VersionMsg[BLADEMOTOR_LENGTH_VERSION_MSG] =
    {0x55, 0xaa, 0x03, 0x20, 0x5a, 0x06, 0x82};
const uint8_t blademotor_pcu8InitMsg[BLADEMOTOR_LENGTH_INIT_MSG] =  { 0x55, 0xaa, 0x12, 0x20, 0x80, 0x00, 0xac, 0x0d, 0x00, 0x02, 0x32, 0x50, 0x1e, 0x04, 0x00, 0x15, 0x21, 0x05, 0x0a, 0x19, 0x3c, 0xaa };
/******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************
*  Public Functions
*******************************************************************************/

static bool blademotor_feedback_qualified_for_reverse(uint32_t now)
{
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    blademotor_feedback_t feedback = blademotor_feedback;
    __set_PRIMASK(primask);

    /* Do not miss a bad/nonzero reply overwritten by a later good reply before
     * this foreground cycle. RX also breaks the epoch across a feedback gap. */
    if (feedback.zero_epoch != blademotor_zero_epoch)
    {
        blademotor_zero_seen = false;
        blademotor_zero_epoch = feedback.zero_epoch;
    }
    if (!blademotor_off_sent || !feedback.valid || feedback.activated ||
        feedback.error || feedback.reported_speed != 0 ||
        (uint32_t)(now - feedback.tick) > BLADEMOTOR_FEEDBACK_MAX_AGE_MS)
    {
        blademotor_zero_seen = false;
        blademotor_last_feedback_seq = feedback.seq;
        return false;
    }
    /* Release only while consuming a new reply. The minimum OFF dwell must
     * not expire into an enable using the same cached zero as the last pass. */
    if (feedback.seq == blademotor_last_feedback_seq)
        return false;
    blademotor_last_feedback_seq = feedback.seq;
    if (!blademotor_zero_seen)
    {
        blademotor_zero_since = feedback.tick;
        blademotor_zero_seen = true;
    }
    /* A latched nonzero word never contributes to this zero-report interval.
     * A direct nonzero-to-zero transition needs the full confirmation window. */
    /* The bench image must never reverse, even when the ESC reports zero.
     * Its purpose is to compare that report with independent rotor observation. */
    return !BLADEMOTOR_COASTDOWN_VALIDATION && blademotor_zero_seen &&
        (uint32_t)(feedback.tick - blademotor_zero_since) >= BLADEMOTOR_ZERO_CONFIRM_MS &&
        (uint32_t)(now - blademotor_stop_since) >= BLADEMOTOR_REVERSE_OFF_MS;
}

void blademotor_prepareMsg(void)
{
    uint8_t command = BLADEMOTOR_STOP_COMMAND_VALUE;
    /* Recheck the system-level actuator gates where the final packet is built.
     * This catches emergency/IDLE events that arrive after cpp_main selected
     * the cached blade request. BLADEMOTOR_App holds IRQs through DMA start. */
    if (Emergency_State() != 0u ||
        main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE)
    {
        blademotor_u8OnOff = 0u;
    }
    if (!BLADEMOTOR_FeedbackHealthy())
    {
        MOTORLINK_ForceInhibit();
    }
    if (!blademotor_u8OnOff)
    {
        /* OFF from the existing emergency/idle/heartbeat gates cancels a
         * pending start. Never retain a queued enable across that request. */
        blademotor_reverse_pending = false;
        blademotor_off_sent = blademotor_zero_seen = false;
    }
    else if (!MOTORLINK_OutputInhibited() && BLADEMOTOR_FeedbackHealthy())
    {
        if (!blademotor_reverse_pending &&
            blademotor_u8Direction != blademotor_u8RunDirection)
        {
            blademotor_reverse_pending = true;
            blademotor_off_sent = blademotor_zero_seen = false;
            blademotor_pending_since = blademotor_pending_report_tick = HAL_GetTick();
        }
        if (!blademotor_reverse_pending || blademotor_feedback_qualified_for_reverse(HAL_GetTick()))
            command = blademotor_u8Direction
                ? BLADEMOTOR_REVERSE_COMMAND_VALUE
                : BLADEMOTOR_FORWARD_COMMAND_VALUE;
    }
    /* Choose the board-specific direction here, where every transmitted frame
     * is built, and compute its checksum from the final command byte.
     * Controller feedback semantics and hardware evidence: BLADE-REVERSE.md. */
    blademotor_pu8RqstMessage[5] = command;
    blademotor_pu8RqstMessage[6] = crcCalc(blademotor_pu8RqstMessage, BLADEMOTOR_LENGTH_RQST_MSG - 1);
}

/**
 * @brief Init the Blade Motor Serial Port (PAC5223)
 * @retval None
 */
void BLADEMOTOR_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* PAC 5223 Reset Line (Blade Motor) */
    PAC5223RESET_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Pin = PAC5223RESET_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
#if defined(BLADEMOTOR_SEQUENCED_POWER)
    /* Keep the PAC logic and active-low blade power gate safe through setup. */
    HAL_GPIO_WritePin(PAC5223RESET_GPIO_PORT, PAC5223RESET_PIN, 0);
#else
    HAL_GPIO_WritePin(PAC5223RESET_GPIO_PORT, PAC5223RESET_PIN, 1);
#endif
    HAL_GPIO_Init(PAC5223RESET_GPIO_PORT, &GPIO_InitStruct);
#if defined(BLADEMOTOR_SEQUENCED_POWER)
    BLADEMOTOR_POWER_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Pin = BLADEMOTOR_POWER_PIN;
    HAL_GPIO_WritePin(BLADEMOTOR_POWER_GPIO_PORT, BLADEMOTOR_POWER_PIN, 1);
    HAL_GPIO_Init(BLADEMOTOR_POWER_GPIO_PORT, &GPIO_InitStruct);
#endif

    // enable port and usart clocks
    BLADEMOTOR_USART_GPIO_CLK_ENABLE();

	// Initiale USART3 for STM32f1 and USART6 for STM32f4
#if BOARD_YARDFORCE500_VARIANT_ORIG
	__HAL_RCC_USART3_CLK_ENABLE();
#elif BOARD_YARDFORCE500_VARIANT_B
	__HAL_RCC_USART6_CLK_ENABLE();
#endif

#if BOARD_YARDFORCE500_VARIANT_ORIG
    // RX
    GPIO_InitStruct.Pin = BLADEMOTOR_USART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(BLADEMOTOR_USART_RX_PORT, &GPIO_InitStruct);

    // TX
    GPIO_InitStruct.Pin = BLADEMOTOR_USART_TX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(BLADEMOTOR_USART_TX_PORT, &GPIO_InitStruct);

    // Alternate Pin Set ?
    __HAL_AFIO_REMAP_USART2_ENABLE();
#elif BOARD_YARDFORCE500_VARIANT_B
    // RX TX
    GPIO_InitStruct.Pin = BLADEMOTOR_USART_TX_PIN | BLADEMOTOR_USART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
    HAL_GPIO_Init(BLADEMOTOR_USART_TX_PORT, &GPIO_InitStruct);
#endif

    BLADEMOTOR_USART_Handler.Instance = BLADEMOTOR_USART_INSTANCE;
    BLADEMOTOR_USART_Handler.Init.BaudRate = 115200;               // Baud rate
    BLADEMOTOR_USART_Handler.Init.WordLength = UART_WORDLENGTH_8B; // The word is  8  Bit format
    BLADEMOTOR_USART_Handler.Init.StopBits = USART_STOPBITS_1;     // A stop bit
    BLADEMOTOR_USART_Handler.Init.Parity = UART_PARITY_NONE;       // No parity bit
    BLADEMOTOR_USART_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE; // No hardware flow control
    BLADEMOTOR_USART_Handler.Init.Mode = USART_MODE_TX_RX;         // Transceiver mode

