liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/blademotor.c
    HAL_UART_Init(&BLADEMOTOR_USART_Handler);

    DB_TRACE(" * Blade Motor UART initialized\r\n");

    /* UART4 DMA Init */
    /* UART4_RX Init */
#if BOARD_YARDFORCE500_VARIANT_ORIG
	hdma_uart_blade_rx.Instance = DMA1_Channel3;
#elif BOARD_YARDFORCE500_VARIANT_B
	hdma_uart_blade_rx.Instance = DMA2_Stream1;
	hdma_uart_blade_rx.Init.Channel = DMA_CHANNEL_5;
	hdma_uart_blade_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
	hdma_uart_blade_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
	hdma_uart_blade_rx.Init.PeriphInc = DMA_PINC_DISABLE;
	hdma_uart_blade_rx.Init.MemInc = DMA_MINC_ENABLE;
	hdma_uart_blade_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
	hdma_uart_blade_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
	hdma_uart_blade_rx.Init.Mode = DMA_NORMAL;
	hdma_uart_blade_rx.Init.Priority = DMA_PRIORITY_LOW;
    if (HAL_DMA_Init(&hdma_uart_blade_rx) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(&BLADEMOTOR_USART_Handler, hdmarx, hdma_uart_blade_rx);
    
    /* UART4 DMA Init */
    /* UART4_TX Init */
#if BOARD_YARDFORCE500_VARIANT_ORIG
	hdma_uart_blade_tx.Instance = DMA1_Channel2;
#elif BOARD_YARDFORCE500_VARIANT_B
	hdma_uart_blade_tx.Instance = DMA2_Stream6;
	hdma_uart_blade_tx.Init.Channel = DMA_CHANNEL_5;
	hdma_uart_blade_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
	hdma_uart_blade_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
	hdma_uart_blade_tx.Init.PeriphInc = DMA_PINC_DISABLE;
	hdma_uart_blade_tx.Init.MemInc = DMA_MINC_ENABLE;
	hdma_uart_blade_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
	hdma_uart_blade_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
	hdma_uart_blade_tx.Init.Mode = DMA_NORMAL;
	hdma_uart_blade_tx.Init.Priority = DMA_PRIORITY_HIGH;
    if (HAL_DMA_Init(&hdma_uart_blade_tx) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(&BLADEMOTOR_USART_Handler, hdmatx, hdma_uart_blade_tx);
    
    // enable IRQ
#if BOARD_YARDFORCE500_VARIANT_ORIG
	IRQn_Type usart_irq = USART3_IRQn;
#elif BOARD_YARDFORCE500_VARIANT_B
	IRQn_Type usart_irq = USART6_IRQn;
#endif

    HAL_NVIC_SetPriority(usart_irq, 0, 0);
	HAL_NVIC_EnableIRQ(usart_irq);
    __HAL_UART_ENABLE_IT(&BLADEMOTOR_USART_Handler, UART_IT_TC);

#if defined(BLADEMOTOR_SEQUENCED_POWER)
    blademotor_state_started_tick = HAL_GetTick();
    blademotor_eState = BLADEMOTOR_RESET_HOLD;
#else
    blademotor_eState = BLADEMOTOR_INIT_1;
#endif
}

/// @brief handle drive motor messages
/// @param  
void  BLADEMOTOR_App(void){
    if (!BLADEMOTOR_FeedbackHealthy())
        MOTORLINK_ForceInhibit();
    switch (blademotor_eState)
    {
#if defined(BLADEMOTOR_SEQUENCED_POWER)
    case BLADEMOTOR_RESET_HOLD:
        if ((uint32_t)(HAL_GetTick() - blademotor_state_started_tick) >= 50u)
        {
            HAL_GPIO_WritePin(PAC5223RESET_GPIO_PORT, PAC5223RESET_PIN, 1);
            blademotor_state_started_tick = HAL_GetTick();
            blademotor_eState = BLADEMOTOR_LOGIC_BOOT;
        }
        break;

    case BLADEMOTOR_LOGIC_BOOT:
        if ((uint32_t)(HAL_GetTick() - blademotor_state_started_tick) >=
                (blademotor_startup_retry_pending ? 1000u : 100u) &&
            BLADEMOTOR_USART_Handler.gState == HAL_UART_STATE_READY &&
            BLADEMOTOR_USART_Handler.RxState == HAL_UART_STATE_READY)
        {
            /* Arm RX before querying the PAC5223. A missing response is
             * bounded and retried while the blade inverter stays unpowered. */
            if (HAL_UART_Receive_DMA(&BLADEMOTOR_USART_Handler,
                    blademotor_pu8ReceivedData,
                    BLADEMOTOR_LENGTH_RECEIVED_MSG) == HAL_OK)
            {
                if (HAL_UART_Transmit_DMA(&BLADEMOTOR_USART_Handler,
                        (uint8_t*)blademotor_pcu8VersionMsg,
                        BLADEMOTOR_LENGTH_VERSION_MSG) == HAL_OK)
                {
                    blademotor_state_started_tick = HAL_GetTick();
                    blademotor_eState = BLADEMOTOR_VERSION_WAIT;
                }
                else
                {
                    (void)HAL_UART_AbortReceive(&BLADEMOTOR_USART_Handler);
                    blademotor_startup_retry_pending = true;
                    blademotor_state_started_tick = HAL_GetTick();
                    ++BLADEMOTOR_u32Error;
                    MOTORLINK_ForceInhibit();
                }
            }
            else
            {
                blademotor_startup_retry_pending = true;
                blademotor_state_started_tick = HAL_GetTick();
                ++BLADEMOTOR_u32Error;
                MOTORLINK_ForceInhibit();
            }
        }
        break;

    case BLADEMOTOR_VERSION_WAIT:
        if ((uint32_t)(HAL_GetTick() - blademotor_state_started_tick) >= 20u &&
            BLADEMOTOR_USART_Handler.gState == HAL_UART_STATE_READY &&
            BLADEMOTOR_USART_Handler.RxState == HAL_UART_STATE_READY)
        {
            if (HAL_UART_Transmit_DMA(&BLADEMOTOR_USART_Handler,
                                      (uint8_t*)blademotor_pcu8InitMsg,
                                      BLADEMOTOR_LENGTH_INIT_MSG) == HAL_OK)
            {
                blademotor_startup_retry_pending = false;
                blademotor_state_started_tick = HAL_GetTick();
                blademotor_eState = BLADEMOTOR_MATRIX_WAIT;
            }
        }
        else if ((uint32_t)(HAL_GetTick() - blademotor_state_started_tick) > 350u)
        {
            (void)HAL_UART_AbortReceive(&BLADEMOTOR_USART_Handler);
            (void)HAL_UART_AbortTransmit(&BLADEMOTOR_USART_Handler);
            blademotor_startup_retry_pending = true;
            blademotor_state_started_tick = HAL_GetTick();
            blademotor_eState = BLADEMOTOR_LOGIC_BOOT;
            ++BLADEMOTOR_u32Error;
            MOTORLINK_ForceInhibit();
        }
        break;

    case BLADEMOTOR_MATRIX_WAIT:
        if ((uint32_t)(HAL_GetTick() - blademotor_state_started_tick) >= 20u &&
            BLADEMOTOR_USART_Handler.gState == HAL_UART_STATE_READY)
        {
            HAL_GPIO_WritePin(BLADEMOTOR_POWER_GPIO_PORT,
                              BLADEMOTOR_POWER_PIN, 0);
            blademotor_state_started_tick = HAL_GetTick();
            blademotor_eState = BLADEMOTOR_POWER_WAIT;
        }
        break;

    case BLADEMOTOR_POWER_WAIT:
        if ((uint32_t)(HAL_GetTick() - blademotor_state_started_tick) >= 50u)
        {
            blademotor_eState = BLADEMOTOR_RUN;
            debug_printf(" * RM1000 Blade Motor Controller initialized\r\n");
        }
        break;
#endif

    case BLADEMOTOR_INIT_1:

