liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/blademotor.c
        HAL_UART_Transmit_DMA(&BLADEMOTOR_USART_Handler, (uint8_t*)blademotor_pcu8InitMsg, BLADEMOTOR_LENGTH_INIT_MSG);
        blademotor_eState = BLADEMOTOR_RUN;
        debug_printf(" * Blade Motor Controller initialized\r\n");     
        break;
    
    case BLADEMOTOR_RUN:

        /*error detected*/
        if(blademotor_pu8ReceivedData[6] != 0){
            blademotor_u8OnOff = 0;
            blademotor_reverse_pending = false;
            blademotor_off_sent = blademotor_zero_seen = false;
            BLADEMOTOR_u32Error++;
        }
        /* Each command gets exactly one bounded response window. Do not issue
         * another request while DMA still owns the RX buffer; a silent or
         * malformed controller must not wedge polling indefinitely. */
        if (blademotor_rx_armed)
        {
            if (BLADEMOTOR_USART_Handler.RxState != HAL_UART_STATE_READY)
            {
                if ((uint32_t)(HAL_GetTick() - blademotor_rx_started_tick) <
                    BLADEMOTOR_RX_TIMEOUT_MS)
                    break;
                (void)HAL_UART_AbortReceive(&BLADEMOTOR_USART_Handler);
                if (BLADEMOTOR_USART_Handler.RxState != HAL_UART_STATE_READY)
                {
                    /* Keep the timeout active if HAL could not reclaim DMA. */
                    blademotor_rx_started_tick = HAL_GetTick();
                    ++BLADEMOTOR_u32Error;
                    MOTORLINK_ForceInhibit();
                    break;
                }
                blademotor_rx_armed = false;
                ++BLADEMOTOR_u32Error;
                MOTORLINK_ForceInhibit();
            }
            else
            {
                /* A full frame completed; BLADEMOTOR_ReceiveIT also clears
                 * this flag, while this path covers HAL completion ordering. */
                blademotor_rx_armed = false;
            }
        }
        if (BLADEMOTOR_USART_Handler.RxState != HAL_UART_STATE_READY ||
            HAL_UART_Receive_DMA(&BLADEMOTOR_USART_Handler,
                blademotor_pu8ReceivedData,
                BLADEMOTOR_LENGTH_RECEIVED_MSG) != HAL_OK)
        {
            ++BLADEMOTOR_u32Error;
            MOTORLINK_ForceInhibit();
            break;
        }
        blademotor_rx_armed = true;
        blademotor_rx_started_tick = HAL_GetTick();

        if (blademotor_reverse_pending &&
            (uint32_t)(HAL_GetTick() - blademotor_pending_report_tick) >= BLADEMOTOR_REVERSE_REPORT_MS)
        {
            blademotor_pending_report_tick = HAL_GetTick();
            BLADEMOTOR_u32Error++;
            debug_printf("Blade reversal waiting: OFF retained (%lu ms)\r\n",
                (unsigned long)(HAL_GetTick() - blademotor_pending_since));
        }
#if BLADEMOTOR_COASTDOWN_VALIDATION
        /* Foreground only; never print in the RX interrupt. Sequence gaps
         * reveal overwritten samples or dropped best-effort UART debug lines. */
        uint32_t primask = __get_PRIMASK();
        __disable_irq();
        blademotor_feedback_t trace = blademotor_feedback;
        __set_PRIMASK(primask);
        if (trace.seq != blademotor_trace_seq)
        {
            blademotor_trace_seq = trace.seq;
            debug_printf("blade coast t=%lu tx=%02x tx_t=%lu seq=%lu rx_t=%lu valid=%u active=%u speed_word=%u err=%u\r\n",
                (unsigned long)HAL_GetTick(), (unsigned)blademotor_trace_command,
                (unsigned long)blademotor_trace_tx_tick, (unsigned long)trace.seq,
                (unsigned long)trace.tick, (unsigned)trace.valid, (unsigned)trace.activated,
                (unsigned)trace.reported_speed, (unsigned)trace.error);
        }
#endif
        /* Do not rewrite a request buffer still owned by the UART DMA. */
        if (BLADEMOTOR_USART_Handler.gState != HAL_UART_STATE_READY) break;
        const uint32_t output_primask = __get_PRIMASK();
        __disable_irq();
        blademotor_prepareMsg();
        if (BLADEMOTOR_USART_Handler.gState == HAL_UART_STATE_READY &&
            HAL_UART_Transmit_DMA(&BLADEMOTOR_USART_Handler,
                (uint8_t*)blademotor_pu8RqstMessage,
                BLADEMOTOR_LENGTH_RQST_MSG) == HAL_OK)
        {
#if BLADEMOTOR_COASTDOWN_VALIDATION
            if (blademotor_trace_command != blademotor_pu8RqstMessage[5])
            {
                blademotor_trace_command = blademotor_pu8RqstMessage[5];
                blademotor_trace_tx_tick = HAL_GetTick();
            }
#endif
            if (blademotor_pu8RqstMessage[5] & 0x80)
            {
                blademotor_u8RunDirection = blademotor_u8Direction;
                blademotor_reverse_pending = false;
            }
            else if (blademotor_reverse_pending && !blademotor_off_sent)
            {
                /* A failed/busy transmission must not start the stop timer.
                 * Only subsequent feedback can qualify this direction change. */
                blademotor_stop_since = HAL_GetTick();
                blademotor_last_feedback_seq = blademotor_feedback.seq;
                blademotor_off_sent = true;
            }
        }
        __set_PRIMASK(output_primask);
        break;
    
    default:
        break;
    }
}

/// @brief control blade motor (there is no speed control for this motor)
/// @param on_off 1 to turn on, 0 to turn off
void BLADEMOTOR_Set(uint8_t on_off, uint8_t direction)
{
    /* Latch the gated request; never modify the DMA-owned message here. */
    blademotor_u8OnOff = on_off != 0;
    blademotor_u8Direction = direction != 0;
    if (!blademotor_u8OnOff)
    {
        blademotor_reverse_pending = false;
        blademotor_off_sent = blademotor_zero_seen = false;
    }
}

/// @brief drive motor receive interrupt handler
/// @param  
void BLADEMOTOR_ReceiveIT(void)
{
    blademotor_rx_armed = false;
    const uint32_t now = HAL_GetTick();
    blademotor_feedback.valid = 0;
    /* decode the frame */    
    if(memcmp(blademotor_pcu8Preamble, blademotor_pu8ReceivedData, 2) == 0){        
        uint8_t l_u8crc = crcCalc(blademotor_pu8ReceivedData, BLADEMOTOR_LENGTH_RECEIVED_MSG-1);

        if(blademotor_pu8ReceivedData[BLADEMOTOR_LENGTH_RECEIVED_MSG-1] == l_u8crc ){
            if((blademotor_pu8ReceivedData[5] & 0x80) == 0x80){
                BLADEMOTOR_bActivated = true;
            }
            else{
                BLADEMOTOR_bActivated = false;
            }
            /* Legacy public RPM field: raw ESC speed word, held after OFF on
             * the tested 500. A new UART reply need not contain a new estimate. */
            BLADEMOTOR_u16RPM = blademotor_pu8ReceivedData[7] + (blademotor_pu8ReceivedData[8]<<8);
            BLADEMOTOR_u16Power = blademotor_pu8ReceivedData[9] + (blademotor_pu8ReceivedData[10]<<8) ;           
            blademotor_feedback.reported_speed = BLADEMOTOR_u16RPM;
            blademotor_feedback.activated = BLADEMOTOR_bActivated;
            blademotor_feedback.error = blademotor_pu8ReceivedData[6];
            blademotor_feedback.valid = 1;
            if (blademotor_seen_valid != 0u &&
                (uint32_t)(now - blademotor_last_valid_tick) >
                    BLADEMOTOR_FEEDBACK_MAX_AGE_MS)
            {
                ++blademotor_fault_sequence;
                MOTORLINK_ForceInhibit();
            }
            blademotor_seen_valid = 1u;
            blademotor_last_valid_tick = now;
            blademotor_last_error = blademotor_pu8ReceivedData[6] != 0u;
            if (blademotor_last_error != 0u)
            {
                ++blademotor_fault_sequence;
                MOTORLINK_ForceInhibit();
            }
        }
        else
        {
            ++blademotor_fault_sequence;
            MOTORLINK_ForceInhibit();
        }

    }
    else
    {
        ++blademotor_fault_sequence;
        MOTORLINK_ForceInhibit();
    }
    if (!blademotor_feedback.valid || blademotor_feedback.activated ||
        blademotor_feedback.error || blademotor_feedback.reported_speed != 0 ||
        (uint32_t)(now - blademotor_feedback.tick) > BLADEMOTOR_FEEDBACK_MAX_AGE_MS)
        blademotor_feedback.zero_epoch++;
    blademotor_feedback.tick = now;
    blademotor_feedback.seq++;
}

bool BLADEMOTOR_FeedbackHealthy(void)
{
    return blademotor_seen_valid != 0u && blademotor_last_error == 0u &&
        (uint32_t)(HAL_GetTick() - blademotor_last_valid_tick) <=
            BLADEMOTOR_FEEDBACK_MAX_AGE_MS;
}

uint32_t BLADEMOTOR_FaultSequence(void)
{
    return blademotor_fault_sequence;
}

/******************************************************************************
*  Private Functions
*******************************************************************************/
